import { ArrowLeftCircleIcon } from 'lucide-react'

export function PersonalDataAgreementPage() {
	return (
		<section className='relative px-4 text-center pt-10'>
			<header className='flex mb-5 flex-col gap-3'>
				<button
					onClick={() => window.history.back()}
					className='cursor-pointer'
				>
					<ArrowLeftCircleIcon color='#27448D' size={32} />
				</button>
				<h1 className='text-xl'>Согласие на обработку персональных данных</h1>
			</header>

			<main className='flex flex-col items-center gap-5'>
				<section>
					<h2>1. Согласие на обработку персональных данных</h2>
					<p>
						Мы собираем и обрабатываем ваши персональные данные, такие как имя,
						электронная почта, IP-адрес и другие данные, которые позволяют вас
						идентифицировать. Обработка данных необходима для выполнения наших
						обязанностей перед вами и предоставления вам наших услуг.
					</p>
				</section>

				<section>
					<h2>2. Цели обработки данных</h2>
					<p>
						Собранные данные используются исключительно для следующих целей: для
						обработки ваших запросов, предоставления вам услуг, улучшения
						качества сервиса, а также для связи с вами в рамках наших
						обязательств.
					</p>
				</section>

				<section>
					<h2>3. Обработка данных третьими сторонами</h2>
					<p>
						Мы не передаем ваши персональные данные третьим лицам, за
						исключением случаев, когда это необходимо для выполнения наших
						обязательств перед вами или в соответствии с требованиями
						законодательства.
					</p>
				</section>

				<section>
					<h2>4. Сроки хранения данных</h2>
					<p>
						Мы будем хранить ваши персональные данные в течение срока,
						необходимого для выполнения целей их обработки, или до тех пор, пока
						вы не отзовете свое согласие на обработку.
					</p>
				</section>

				<section>
					<h2>5. Ваши права</h2>
					<p>
						Вы имеете право на доступ к своим персональным данным, их изменение
						или удаление. Вы можете отозвать свое согласие в любое время,
						отправив нам запрос через контактную форму на сайте.
					</p>
				</section>

				<section>
					<h2>6. Безопасность данных</h2>
					<p>
						Мы принимаем все необходимые меры для защиты ваших персональных
						данных от несанкционированного доступа, использования, изменения или
						удаления.
					</p>
				</section>

				<section>
					<h2>7. Изменения в соглашении</h2>
					<p>
						Мы оставляем за собой право время от времени изменять условия
						данного соглашения. Все изменения будут опубликованы на этой
						странице с соответствующим обновлением даты.
					</p>
				</section>

				<section>
					<h2>8. Контактная информация</h2>
					<p>
						Если у вас есть вопросы по поводу данного соглашения, пожалуйста,
						свяжитесь с нами через контактную форму на сайте.
					</p>
				</section>
			</main>

			<footer className='text-center mt-5'>
				<p>&copy; Все права защищены.</p>
			</footer>
		</section>
	)
}
